import React from "react";
import { IoIosArrowForward } from "react-icons/io";

const Faqs = () => {
  const data = [
    {
      question: "আপনারা কি পণ্যের গুণগত মান নিশ্চিত করার জন্য কোন পদক্ষেপ গ্রহণ করেন?",
      answer: "আমরা পণ্যের গুণগত মানের ওপর অত্যল্প গুরুত্ব দিয়ে চলেছি। প্রতিটি পণ্যই আমাদের কাছে উন্নত গুণগত মান এবং দৈনিক ব্যবহারের জন্য উপযোগী হওয়ার আশ্বাস দিয়ে তৈরি হয়। আমরা প্রতিটি সরবরাহকারী এবং উৎপাদকের যাচাই করি যে তারা আমাদের মান মান এবং বাস্তবায়িত প্রত্যাশায় অনুযায়ী তৈরি করেছেন। এছাড়াও, আমাদের ইনহাউস গুণমান নিয়ন্ত্রণ দল প্রতিটি পণ্যের উপর যত্নশীলভাবে পরিক্ষা করে যে তা আপনার হাতে পৌঁছানোর আগে সর্বোত্তম মানের অবস্থায় আছে।",
    },
    {
      question: "আপনারা ডেলিভারি পদ্ধতি সম্পর্কে জানতে কী করবেন?",
      answer: "আমরা আমাদের গ্রাহকদের জন্য সুবিধাজনক এবং দ্রুত ডেলিভারি পদ্ধতি উপলব্ধ করে থাকি। আপনি সহজেই আমাদের ওয়েবসাইট থেকে পণ্য অর্ডার করতে পারেন এবং আমরা নির্ধারিত সময়ে আপনার ঠিকানায় পণ্য পৌঁছে দেব। আমাদের দক্ষ ফুলফিলমেন্ট দল দ্রুততম উপায়ে আপনার অর্ডার প্রস্তুত করে এবং এটি সুরক্ষিতভাবে প্যাকেজ করে আপনার পণ্য প্রেরণ করে।",
    },
    {
      question: "আপনাদের ওয়েবসাইট থেকে কিভাবে অর্ডার করতে পারি?",
      answer: "আমাদের ওয়েবসাইট থেকে অর্ডার করা সহজ এবং সরল। প্রথমে, আপনি আমাদের ওয়েবসাইটে লগইন করে লগ ইন করতে পারেন বা নতুন একটি অ্যাকাউন্ট তৈরি করতে পারেন। তারপরে, আপনি আমাদের সম্পূর্ণ রেঞ্জে ব্রাউজ করতে পারেন এবং আপনার পছন্দের পণ্যটি নির্বাচন করতে পারেন। পণ্যের বিবরণ ও মূল্য পরীক্ষা করে নিশ্চিত হলে, অর্ডার করার জন্য 'অর্ডার করুন' বা সমতুল্য বোতামে ক্লিক করুন।",
    },
    {
      question: "আমি পণ্যে অসন্তোষজনক হলে কি করতে পারি?",
      answer: "আমাদের গ্রাহকের সন্তুষ্টিই আমাদের সর্বোচ্চ লক্ষ্য। যদি আপনি আমাদের পণ্যে কোনও অসন্তোষ অনুভব করেন, অনুগ্রহ করে তা আমাদেরকে জানান। আমাদের গ্রাহক সেবা দল আপনার সমস্যার সমাধানে সাহায্য করতে সততা অভিনব করা হবে।",
    },
    {
      question: "কীভাবে প্রোডাক্টের আপডেট বা নতুনত্বের তথ্য জানতে পারি?",
      answer: "আপনি আমাদের ওয়েবসাইটে সাবস্ক্রাইব করতে পারেন যাতে আপনি নতুন পণ্য এবং বিশেষ অফারের তথ্য ইমেইলের মাধ্যমে পেতে পারেন।",
    },
    {
      question: "পণ্যের গ্যারান্টি সম্পর্কিত তথ্য কি পেতে পারি?",
      answer: "আমাদের বেশিরভাগ পণ্যগুলিতে নির্দিষ্ট সময়ের জন্য গ্যারান্টি দেওয়া হয়। অনুগ্রহ করে প্রতিটি পণ্যের গ্যারান্টির জন্য আলাদা শর্তাবলী দেখুন বা আমাদের কাস্টমার সার্ভিসের সাথে যোগাযোগ করুন।",
    },
    {
  question: "আপনারা কি অনলাইনে ক্রয়কৃত পণ্যের বিনিময় বা ফেরতের সুযোগ প্রদান করেন?",
  answer: "আমরা অনলাইনে ক্রয়কৃত পণ্যের ফেরত এবং বিনিময়ের সুযোগ প্রদান করি। পণ্য গ্রহণের ৭ দিনের মধ্যে আপনি পণ্যটি ফেরত দিতে পারেন। তবে, ফেরত দেওয়ার আগে আমাদের গ্রাহক সেবা দলের সাথে যোগাযোগ করে প্রক্রিয়া নিশ্চিত করুন।",
}
  ];

  return (
    <div>
      <div className="border rounded-lg">
        {data.map((item, index) => (
          <details key={index} className="group [&_summary::-webkit-details-marker]:hidden border-b">
            <summary className="flex cursor-pointer justify-start items-start gap-1.5 rounded-lg bg-gray-50 p-4 text-gray-900">
              <IoIosArrowForward className="size-5 shrink-0 transition duration-300 group-open:rotate-90" />
              <h2 className="font-medium">{item.question}</h2>
            </summary>
            <p className="mt-2 px-4 leading-relaxed text-gray-700">{item.answer}</p>
          </details>
        ))}
      </div>
    </div>
  );
};

export default Faqs;